#!/usr/bin/perl
use utf8;
#
undef $/;
#
$_ = <>;

####
# This is for moving the kpv into the comment
##
#lexc
#
#s/([^\n:]*)(:)([^_\n]*)(\ [^\n"]+\"|\ A[^_\n ]*_[^"\n]*\"|\ A[^_\n ]*\-[^"\n]*\")([^"\n]*)(\"\ *\;)/$1$2$3$4\(kpv\)\.\.$1$2$3\.\.$6/g; 
#
#V
#абутӧммӧдны:абутӧммӧд 
s/(\n[^\n:]*ӧ)д(ны:[^ \n_]*ӧ)д\ /$1т$2т\ /g;
#аддзӧдлыны:аддзӧдл
s/(\n[^\n:]*ӧ)д(лыны:[^ \n_]*ӧ)д(л)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(лывлыны:[^ \n_]*ӧ)д(лывл)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(лыштны:[^ \n_]*ӧ)д(лышт)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(авны:[^ \n_]*ӧ)д(а)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(авлыны:[^ \n_]*ӧ)д(авл)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(ыштны:[^ \n_]*ӧ)д(ышт)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(ыштавны:[^ \n_]*ӧ)д(ышта)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(чыштны:[^ \n_]*ӧ)д(чышт)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(чыштлыны:[^ \n_]*ӧ)д(чыштл)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(чыны:[^ \n_]*ӧ)д(ч)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(чывны:[^ \n_]*ӧ)д(чы)\ /$1т$2т$3\ /g;
s/(\n[^\n:]*ӧ)д(чавны:[^ \n_]*ӧ)д(ча)\ /$1т$2т$3\ /g;

####

print ;
